# Shift Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillGrid..::..Shift Property
FillGrid Class See Also
---
Gets and sets the shift of the fill grid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double Shift { get; set; }
```

Visual Basic
---
```text
Public Property Shift As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Shift {
	double get ();
	void set (double value);
}
```

# ### Field Value
The shift of the fill grid.
# Remarks
Shift moves the pattern of dashes and spaces along the length of each new parallel line. Shift is ignored if the line is solid.
# See Also
FillGrid Class
Autodesk.Revit.DB Namespace